html/org-pages/week4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-17 dom 14:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Week 4 - my own writings</title>
<meta name="author" content="Luís Guilherme Miranda Spengler" />
<meta name="description" content="Week 4 - my own writings" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Week 4 - my own writings</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge341e7c">1. Week 4 (Qubit by Qubit)</a>
<ul>
<li><a href="#org2fe8cb3">1.1. RECAP:</a>
<ul>
<li><a href="#org8e672cd">1.1.1. Quantum mechanics:</a></li>
</ul>
</li>
<li><a href="#org5e9b8ed">1.2. Quantum Gates and Measurement</a>
<ul>
<li><a href="#orgd0bee2e">1.2.1. Representing Qubits</a></li>
<li><a href="#org577a832">1.2.2. Ket Notation</a>
<ul>
<li><a href="#org7c53ad4">1.2.2.1. Schrodinger&rsquo;s ket</a></li>
</ul>
</li>
<li><a href="#org822cc7c">1.2.3. the Block sphere</a></li>
<li><a href="#org762706a">1.2.4. Quantum Gates</a>
<ul>
<li><a href="#org534012e">1.2.4.1. The X gate</a></li>
<li><a href="#org15c3a5b">1.2.4.2. The H gate</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3d6e0bd">1.3. Guest speaker:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge341e7c" class="outline-2">
<h2 id="orge341e7c"><span class="section-number-2">1.</span> Week 4 (Qubit by Qubit)</h2>
<div class="outline-text-2" id="text-1">
<p>
test \(E=mc^2\)
</p>
</div>
<div id="outline-container-org2fe8cb3" class="outline-3">
<h3 id="org2fe8cb3"><span class="section-number-3">1.1.</span> RECAP:</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org8e672cd" class="outline-4">
<h4 id="org8e672cd"><span class="section-number-4">1.1.1.</span> Quantum mechanics:</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Qubits have discrete states and we can use these 0s and 1s in computation.</li>
<li>In adition to being 0 or 1, qubits can also be in a superposition and therefore, can hold exponentionally more information than classical</li>
<li>Superposition powers: Process all possibilities of solving a problem at the same time.</li>
<li>Interference powers: Rules out incorrect possible solutions, making them interfere with each other destructively and correct ones interfere constructively.</li>
<li>Quantum computers excel at finding one solution among massive amounts of possibilities.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5e9b8ed" class="outline-3">
<h3 id="org5e9b8ed"><span class="section-number-3">1.2.</span> Quantum Gates and Measurement</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgd0bee2e" class="outline-4">
<h4 id="orgd0bee2e"><span class="section-number-4">1.2.1.</span> Representing Qubits</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Superconducting qubits (Google, IBM), trapped ion qubits (IONq), Photonics (PsiQuantum) are some types of qubits, but they all obey quantum mechanics laws as well as <b>having the same way to represent them.</b></li>
<li>Represntation is a way to write down and show what&rsquo;s happening, without worring to much about the physics.</li>
</ul>
<p>
Ket notation and the Block sphere are two common ways to describe qubits instead of using arrows.
</p>
</div>
</div>

<div id="outline-container-org577a832" class="outline-4">
<h4 id="org577a832"><span class="section-number-4">1.2.2.</span> Ket Notation</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>1 and 0 are not just numbers, they are <b>quantum states.</b> and to represent that, we use kets.</li>
<li>Anything inside | &gt; it means it&rsquo;s a quantum state. Ex: |1&gt;, |2&gt; and Superposition of |0&gt; and |1&gt;</li>
<li>AKA bra-ket notation or Dirac notation.</li>
</ul>
</div>
<div id="outline-container-org7c53ad4" class="outline-5">
<h5 id="org7c53ad4"><span class="section-number-5">1.2.2.1.</span> Schrodinger&rsquo;s ket</h5>
<div class="outline-text-5" id="text-1-2-2-1">
<ul class="org-ul">
<li>|alive&gt; + |dead&gt;</li>
<li>In future weeks, we will be learning some math with kets.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org822cc7c" class="outline-4">
<h4 id="org822cc7c"><span class="section-number-4">1.2.3.</span> the Block sphere</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>Qubits can be in more than three states (different than using arrow notation, that uses <b>Equal Superpostion</b>).</li>
</ul>
<p>
Show images of it&#x2026;
</p>
<ul class="org-ul">
<li>Unequal superpositions are the ones that are not either 0, 1 or 50% superposition. It&rsquo;s like 30% of 0 and 70% of 1. They are like an unfair coin.</li>
</ul>
</div>
</div>

<div id="outline-container-org762706a" class="outline-4">
<h4 id="org762706a"><span class="section-number-4">1.2.4.</span> Quantum Gates</h4>
<div class="outline-text-4" id="text-1-2-4">
<ul class="org-ul">
<li>Quantum gates convert a qubit from one state to another.</li>
<li>The computations that quantum gates make can be visualized as rotations on the Bloch sphere.</li>
<li>There are a lot of gates. But we&rsquo;ll be focusing on 3 (X gate, H gate, Z gate) of them first, 2 of them today (H and X gate).</li>
<li>For gates, we will need a 3-D coordinate system. Like x,y,z. and we can place the Bloch sphere on this coordinate system.</li>
<li>|0&gt; lies along z, as well as |1&gt;. Equal superposition |0&gt;+|1&gt; lies along x axis.</li>
</ul>
</div>

<div id="outline-container-org534012e" class="outline-5">
<h5 id="org534012e"><span class="section-number-5">1.2.4.1.</span> The X gate</h5>
<div class="outline-text-5" id="text-1-2-4-1">
<ul class="org-ul">
<li>it gives the opposite of the input (hint: just like NOT gate in classical computing)</li>
<li>Input: |0&gt; Output: |1&gt;</li>
<li>Input: |1&gt; Output: |0&gt;</li>
<li>Its name is &ldquo;X gate&rdquo; because it does a rotation of 180º around the X axis.</li>
</ul>
</div>
</div>

<div id="outline-container-org15c3a5b" class="outline-5">
<h5 id="org15c3a5b"><span class="section-number-5">1.2.4.2.</span> The H gate</h5>
<div class="outline-text-5" id="text-1-2-4-2">
<ul class="org-ul">
<li>AKA Hadamard gate</li>
<li>It is a purely quantum gate (has no classical equivalent) and only exists on quantum computers.</li>
<li>It creates a superposition.</li>
<li>Input: |0&gt; Output: |+&gt;</li>
<li>Input: |1&gt; Output: |-&gt;</li>
<li>|+&gt; and |-&gt; are examples of superpositions.</li>
<li>It rotates 90º on any axis, creating a superposition.</li>
<li>We will learn more math to understand the difference between the |+&gt; and |-&gt; states.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org3d6e0bd" class="outline-3">
<h3 id="org3d6e0bd"><span class="section-number-3">1.3.</span> Guest speaker:</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Dr. Casey Berger, visiting assistant. Computational physics.
science fiction she&rsquo;s written: URSA MAJOR, FIRST LIGHT, DARK STARTS <a href="https://www.caseybergerbooks.com/">https://www.caseybergerbooks.com/</a>
She studies superfluids.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Guilherme Miranda Spengler</p>
<p class="date">Created: 2021-10-17 dom 14:36</p>
</div>
</body>
</html>
